<!-- dflook/terraform-github-actions {"workspace":"verify-opentofu","backend_type":"remote","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"0ff27369508d85bcacced9edc9036bd3156675cee4c40abe6e6b82288e7d256e","plan_job_ref":"Job Test plan target and replace #404 at https://github.com/dflook/terraform-github-actions/actions/runs/7503550453","plan_hash":"efa163a7ea8296aa302f58664947461d5a3bbf343da6bfb76e5bcb7afc8c0865","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __verify-opentofu__ workspace
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "R6FdWBqgcN" -> (known after apply)
!~  foreach = "Graq9yuS5W" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #404](https://github.com/dflook/terraform-github-actions/actions/runs/7503550453)